
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
		
	//#Если ВебКлиент Тогда	
	//Если ВидФормы = "Форма" Тогда
	//	
	//	ДанныеЭкранаКлиента = ПолучитьИнформациюЭкрановКлиента();	
	//	Высота = ДанныеЭкранаКлиента[0].Высота; 
	//	Ширина = ДанныеЭкранаКлиента[0].Ширина;       
	//	//Если Veltrix_АдаптацияИнтерфейса.ЭтоМобильноеУстройство(Ширина,Высота) Тогда 
	//		СтандартнаяОбработка = Ложь; // Отключаем стандартную форму
	//		ВыбраннаяФорма = "ФормаМобилильная";
	//	//КонецЕсли;
	//	
	//КонецЕсли;
	//#КонецЕсли
      
КонецПроцедуры
