
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Цвет = ТекущийОбъект.Цвет.Получить();

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьСписокВыбораВремени();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Объект.Ссылка.Пустая() Тогда
	Цвет = Новый Цвет(0,150,70);	
	Объект.Салон = Справочники.Салоны.ОсновнойСалон();
	Дата = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Цвет = Новый ХранилищеЗначения(Цвет);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	Оповестить("Изменение_Запись");

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УслугаПриИзменении(Элемент)
	
	Если Объект.Услуга.Пустая() Тогда
		Объект.Длительность = 0;
		Объект.Сумма = 0;
		Объект.КоличествоУслуг = 0;
	Иначе
		ИнформацияОбУслуге = ПолучитьИнформациюОбУслугеНаСервере(Объект.Услуга, Объект.Дата);
		Объект.Длительность = ИнформацияОбУслуге.Длительность;
		Объект.Сумма		= ИнформацияОбУслуге.Цена; 
		Объект.КоличествоУслуг = 1;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИнформациюОбУслугеНаСервере(Услуга, Дата)
	Возврат Veltrix_СлужебныеПроцедурыИФункции.ПолучитьИнформациюОбУслуге(Услуга,Дата);
КонецФункции

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)

	ОбновитьСписокВыбораВремени();
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)

	ОбновитьСписокВыбораВремени();

КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОформитьПродажу(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Сначала сохраните запись";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;  
	
	СтруктураПараметров = Новый Структура("Основание", Объект.Ссылка);
	ОткрытьФорму("Документ.Продажа.ФормаОбъекта", СтруктураПараметров,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры   

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
#КонецОбласти

#Область СлужебныеПроцедурыИФункции


&НаСервере
Процедура ОбновитьСписокВыбораВремени()
	
	НомерДняНедели = ДеньНедели(Объект.Дата);

	ДниНедели = Новый Соответствие;
	ДниНедели.Вставить(1, Перечисления.ДниНедели.Понедельник);
	ДниНедели.Вставить(2, Перечисления.ДниНедели.Вторник);
	ДниНедели.Вставить(3, Перечисления.ДниНедели.Среда);
	ДниНедели.Вставить(4, Перечисления.ДниНедели.Четверг);
	ДниНедели.Вставить(5, Перечисления.ДниНедели.Пятница);
	ДниНедели.Вставить(6, Перечисления.ДниНедели.Суббота);
	ДниНедели.Вставить(7, Перечисления.ДниНедели.Воскресенье);
	
	ДеньНедели = ДниНедели.Получить(НомерДняНедели);
	
	Элементы.Время.СписокВыбора.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СалоныРежимРаботы.ВремяНачала КАК ВремяНачала,
		|	СалоныРежимРаботы.ВремяОкончания КАК ВремяОкончания
		|ИЗ
		|	Справочник.Салоны.РежимРаботы КАК СалоныРежимРаботы
		|ГДЕ
		|	СалоныРежимРаботы.Ссылка = &Салон
		|	И СалоныРежимРаботы.ДеньНедели = &ДеньНедели";
	
	Запрос.УстановитьПараметр("ДеньНедели", ДеньНедели);
	Запрос.УстановитьПараметр("Салон", Объект.Салон);
	
	РезультатЗапроса = Запрос.Выполнить();

	ИнтервалЗаписи = 1800;// 30 минут
	Если НЕ РезультатЗапроса.Пустой() Тогда

		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();

		ТекВремя = Выборка.ВремяНачала;
		
		Пока ТекВремя < Выборка.ВремяОкончания Цикл
			
			ДатаВремя = НачалоДня(Объект.Дата) + (ТекВремя - '00010101');
			Элементы.Время.СписокВыбора.Добавить(ДатаВремя, Формат(ДатаВремя, "ДФ=ЧЧ:мм"));
			
			ТекВремя = ТекВремя + ИнтервалЗаписи;
			
		КонецЦикла;

	КонецЕсли;

КонецПроцедуры // ОбновитьСписокВыбораВремени()

&НаКлиенте
Процедура УвеличитьКоличество(Команда)
	
	Если Объект.КоличествоУслуг > 0 Тогда	
	Цена = Объект.Сумма / Объект.КоличествоУслуг; 
	Длительность = Объект.Длительность / Объект.КоличествоУслуг;	
	Объект.КоличествоУслуг = Объект.КоличествоУслуг + 1;
	Объект.Длительность = Объект.КоличествоУслуг * Длительность;
	Объект.Сумма = Объект.КоличествоУслуг * Цена;
	Иначе
	Сообщить("Выберите услугу перед увеличением");	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьКоличество(Команда)
		
	Если Объект.КоличествоУслуг > 1 Тогда 
	Цена = Объект.Сумма / Объект.КоличествоУслуг; 
	Длительность = Объект.Длительность / Объект.КоличествоУслуг;	
	Объект.КоличествоУслуг = Объект.КоличествоУслуг - 1;
	Объект.Длительность = Объект.КоличествоУслуг * Длительность;
	Объект.Сумма = Объект.КоличествоУслуг * Цена;	
	КонецЕсли;
		
КонецПроцедуры  

&НаКлиенте
Процедура ВремяПриИзменении(Элемент)

	Если ЗначениеЗаполнено(Объект.Сотрудник) = Ложь Тогда
	Сообщить("Выберите мастера");	
	КонецЕсли;

КонецПроцедуры



#КонецОбласти