
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ИсторияЗаписей
	Движения.ИсторияЗаписей.Записывать = Истина;
	Движение = Движения.ИсторияЗаписей.Добавить();
	Движение.Период = Дата;
	Движение.Салон = Салон;
	Движение.Клиент = Клиент;
	Движение.Сотрудник = Сотрудник;
	Движение.Услуга = Услуга;
	Движение.Сумма = Сумма;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ДатаОкончания = Дата + Длительность * 60;
	
	Если РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения Тогда
		ЕстьЗапись =  Veltrix_СлужебныеПроцедурыИФункции.ПроверитьДоступностьЗаписи(Салон,Дата,ДатаОкончания,Сотрудник);
		
		Если ЕстьЗапись <> Неопределено Тогда
			Сообщить("Данное время не доступно для записи так как уже есть запись: "+ЕстьЗапись.Запись +Символы.ПС 
			+"Клиент: " + ЕстьЗапись.Клиент); 	
			Отказ = Истина;	
			Возврат;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
