
&НаСервере
Функция ПроверитьДоступностьЗаписи (Салон,ДатаНачало,ДатаКонец,Сотрудник) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Запись.Ссылка КАК Ссылка,
		|	Запись.Клиент КАК Клиент
		|ИЗ
		|	Документ.Запись КАК Запись
		|ГДЕ
		|	Запись.Проведен
		|	И Запись.Салон = &Салон
		|	И Запись.Сотрудник = &Сотрудник
		|	И (Запись.Дата < &ДатаНачала
		|				И Запись.ДатаОкончания > &ДатаНачала
		|			ИЛИ Запись.Дата < &ДатаКонец
		|				И Запись.ДатаОкончания > &ДатаКонец)";
	
	Запрос.УстановитьПараметр("Салон", Салон);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачало);
	Запрос.УстановитьПараметр("ДатаКонец", ДатаКонец);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда 
	Запись = РезультатЗапроса.Выгрузить()[0];
	ОтветСтруктура= Новый Структура;	
	ОтветСтруктура.Вставить("Запись",Запись.Ссылка);
	ОтветСтруктура.Вставить("Клиент",Запись.Клиент);	
	Возврат ОтветСтруктура;
	Иначе 
	Возврат Неопределено;
	КонецЕсли;
	
КонецФункции         


&НаСервере
Функция ПолучитьИнформациюОбУслуге(Услуга, Дата)  Экспорт
	
	Результат = Новый Структура("Длительность, Цена", 0, 0);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) КАК Цена,
		|	Услуги.Длительность КАК Длительность
		|ИЗ
		|	Справочник.Услуги КАК Услуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних(&Дата, Услуга = &Услуга) КАК ЦеныСрезПоследних
		|		ПО Услуги.Ссылка = ЦеныСрезПоследних.Услуга
		|ГДЕ
		|	Услуги.Ссылка = &Услуга";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Услуга", Услуга);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
	
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции
